frontend/tests/performance/load-test.yml
config:
  target: 'http://localhost:8001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 100
      name: "Stress test"

scenarios:
  - name: "API Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
  
  - name: "Get Ping Records"
    weight: 40
    flow:
      - get:
          url: "/api/pings"
          qs:
            limit: 50
            offset: 0
  
  - name: "Get Statistics"
    weight: 20
    flow:
      - get:
          url: "/api/stats"
          qs:
            hours: 24
  
  - name: "Get Recent Records"
    weight: 20
    flow:
      - get:
          url: "/api/recent"
          qs:
            minutes: 60